test/multiphaseEuler/populationBalance/breakup/constant/phaseProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      phaseProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

phases          (air1 air2 air3 water);

populationBalances (bubbles);

air1
{
    type            pureIsothermalPhaseModel;

    diameterModel   velocityGroup;
    velocityGroupCoeffs
    {
        populationBalance bubbles;

        shapeModel      spherical;

        sizeGroups
        (
            { dSph 2.8193481473E-02; }
            { dSph 3.2273479789E-02; }
            { dSph 3.6943911970E-02; }
            { dSph 4.2290222209E-02; }
            { dSph 4.8410219684E-02; }
            { dSph 5.5415867956E-02; }
            { dSph 6.3435333314E-02; }
            { dSph 7.2615329525E-02; }
            { dSph 8.3123801935E-02; }
            { dSph 9.5152999970E-02; }
            { dSph 1.0892299429E-01; }
            { dSph 1.2468570290E-01; }
            { dSph 1.4272949995E-01; }
            { dSph 1.6338449143E-01; }
            { dSph 1.8702855435E-01; }
            { dSph 2.1409424994E-01; }
            { dSph 2.4507673715E-01; }
            { dSph 2.8054283153E-01; }
            { dSph 3.2114137490E-01; }
            { dSph 3.6761510572E-01; }
        );
    }

    residualAlpha   1e-6;
}

air2
{
    type            pureIsothermalPhaseModel;

    diameterModel   velocityGroup;
    velocityGroupCoeffs
    {
        populationBalance bubbles;

        shapeModel      spherical;

        sizeGroups
        (
            { dSph 4.2081424730E-01; }
            { dSph 4.8171206235E-01; }
            { dSph 5.5142265857E-01; }
            { dSph 6.3122137094E-01; }
            { dSph 7.2256809352E-01; }
        );
    }

    residualAlpha   1e-6;
}

air3
{
    type            pureIsothermalPhaseModel;

    diameterModel   velocityGroup;
    velocityGroupCoeffs
    {
        populationBalance bubbles;

        shapeModel      spherical;

        sizeGroups
        (
            { dSph 8.2713398787E-01; }
            { dSph 9.4683205641E-01; }
            { dSph 1.0838521403E+00; }
            { dSph 1.2407009818E+00; }
        );
    }

    residualAlpha   1e-6;
}

water
{
    type            pureIsothermalPhaseModel;

    diameterModel   none;

    residualAlpha   1e-6;
}

blending
{
    default
    {
        type            continuous;
        phase           water;
    }
}

surfaceTension
{}

populationBalanceCoeffs
{
    bubbles
    {
        continuousPhase water;

        coalescenceModels
        ();

        binaryBreakupModels
        ();

        breakupModels
        (
            powerLaw
            {
                power           2.0;
                daughterSizeDistributionModel uniformBinary;
            }
        );
    }
}

// ************************************************************************* //
